# random 라이브러리 사용 (난수값 사용 할 때)
from random import *

# 0.0 ~ 1.0 미만의 임의의 값 생성
#print(random())
# 0.0 ~ 10.0 미만의 임의의 값 생성
#print(random() * 10)
# 0 ~ 10 미만의 임의의 정수값 생성
#print((int)(random() * 10))
# 1 ~ 10 이하의 임의의 정수값 생성
#print((int)(random() * 10) + 1)


# 로또 값 출력해보기 (1 ~ 45이하)
#print((int)(random() * 45) + 1)
# randrange() : 1 ~ 46 미만의 임의의 정수값 생성
#print(randrange(1, 46))
# randint() : 1 ~ 45 이하의 임의의 정수값 생성
#print(randint(1, 45))


# Quiz
# 조건 1. 랜덤으로 날짜를 뽑아야 함.
# 조건 2. 월별 날짜는 다름을 감안하여 최소 일수인 28 이내로 정함
# 조건 3. 매월 1~3일은 스터디 준비를 해야 하므로 제외
# 출력문 예제 : 오프라인 스터디 모임 날짜는 매월 x일로 선정되었습니다.

a = randint(4,28)

print(f"오프라인 스터디 모임 날짜는 매월 {a}일로 선정되었습니다.")




